{"Contents":["<p><strong><em>By Oleg Goodwin, with assistance from grove elder Galor.</em></strong></p>

Among all my esteemed and fruitful travels, never have I been afflicted with such dawning dread as i've departed in my traveling wagon, as I have endured leaving the Caustic Cove. My studies of the indigenous and enigmatic bog flower have implanted with me a heartfelt worry for the local druid grove and the neighbouring village, and in due time I wish no further encroachment and terror from the bog flower as I depart for the people of this meagre hovel.

Firstly let me remark on the sheer giangantic anatomy, of what should wherein be known as the corpus carnipii plant. The crimson like coloration of it's rampant overgrowths infect the surrounding bog with it's ever shifting vines, of which you would spot almost immediately from the swampy treeline native to the Cove's bog. Log like protrusions from the ground sprout into inordinately sized hedges of red, the leaves of which are serrated and dagger like, yet lush and soft as fair elven forest. The edges are jagged yet, but will not cut. Rather, the most prickly danger surrounding the foilage are the accompanying vines of treacherous thornage. They oft grow over top the anterior of he bushes, parting the bushels under their weight and sapping life from the forsaken trees growing alongside it all.

The second most remarkable feature I must elucidate upon are the terrible sphincters in the earth that gape and part the land, bellowing a stench most horrid and caustic. For this I believe, may impart the region's well deserved namesake for the plant's sheer fragrance. The holes of which grip the captive dirt with ample vines and leaves, life all but drained from the swamp soil. The pits of which these horrid holes lead to appear to drop down into a steaming pool of acidic fluids, an observation i've deduced after tossing a punctured kettle helmet down into it from my bag of tools. The metal floated, briefly, but was soon sunken in a plume of foul and choking fumes, the last I was able to see of it being a sea of roiling bubbles and fierce sizzling. Giant, otherworldly pillars of bone stuck out within the pits, it's purpose I didn't remain to investigate as I felt my mind slipping at the sheer eldritch presence of it all.

The local druidic tribe, of which their humble hovel lies within the rock face above the swamp valley of the bog, answered my most inquisitive of questions and offered much respite from the travel, to which I applaud still of their Eoran generousity and care. Elder Galor of the grove in particular educated me in a most pleasant retelling of their past and history. The bog flower as previously described, was once more a terrible sight of wild, whipping vines and possessed woods dragging all manners of beast and man to it's acidic depths, never to be seen again. It's crimson coloration said to be more prominent as it consumes more and more; a behavior noticed in the colder months as lyfe in the bog slows, as the plant grows brown and wilts much like the woods around it. Oft, a semi annual ritual takes place within the grove that calls for the sacrifice of man to be fed into the corpus carnipii. Through this, the growth of the corpus carnipii is said to be stalled, sated on the body of the druid and further nourished by their devotion to dendor. Such a tradition has been maintained for a good three years, however due to the dwindling of the grove's senior minds, initiates have been recently elected to serve as ample sacrifices. Though, even this, the elder says has not been enough. I asked the elder if tribute from the neighbouring village has been an option from what i've been told, but they declined to discuss it further, only reminding that without proper sacrifice the flower shall continue to grow and furrow, strangling the land and collapsing the ground, taking house and home."]}
